InformationRegisters/омг_ТокеныАвторизацииСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ТокеныАвторизацииСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЖизниВСекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омг_ИнтеграцияССервисами/Ext/Module.bsl
Процедура омг_КорректировкаЖизниТокеновАвторизации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.омг_ТокеныАвторизацииСервисов КАК омг_ТокеныАвторизацииСервисов";
	ВыборкаТокенов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТокенов.Следующий() Цикл
		
		ВремяЖизниВСекундах = ВыборкаТокенов.ВремяЖизниВСекундах - 60;
		
		Если ВыборкаТокенов.ВремяЖизниВСекундах <= 0 Или КонецДня(ВыборкаТокенов.ДатаОкончания) < ТекущаяДата() Тогда
			Запись = РегистрыСведений.омг_ТокеныАвторизацииСервисов.СоздатьМенеджерЗаписи();
			Запись.Токен = ВыборкаТокенов.Токен;
			Запись.Удалить();
		Иначе
			Запись = РегистрыСведений.омг_ТокеныАвторизацииСервисов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаТокенов);
			Запись.ВремяЖизниВСекундах = ВремяЖизниВСекундах;
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
